import random

PROFESSIONS = [
    "Инфлюенсер/Блогер", "Профессиональный геймер", "АВТОМЕХАНИК", "АДВОКАТ", "АРХЕОЛОГ", "БИОЛОГ", "БРАКОНЬЕР", "ВИДЕОИНЖЕНЕР", "ВИРУСОЛОГ", "ВОЕННЫЙ", "ГОМЕОПАТ", "ГРАБИТЕЛЬ", "ДЕТЕКТИВ", "ДИЗАЙНЕР",
    "ДОМОХОЗЯЙКА", "ЖУРНАЛИСТ", "ЗНАХАРЬ", "ИСТОРИК", "КОУЧ", "ЛЕСНИК", "ЛЕТЧИК-ИНЖЕНЕР", "МАРКЕТОЛОГ", "МЕДСЕСТРА", "МОДЕЛЬ", "ПАПАРАЦЦИ", "ПЕРЕВОДЧИК", "ПИСАТЕЛЬ", "ПОВАР", "ПОЖАРНЫЙ", "ПОЛИЦЕЙСКИЙ",
    "ПРОГРАММИСТ", "ПРОДАВЕЦ", "ПСИХОЛОГ", "РАЗНОРАБОЧИЙ", "РОБОТОТЕХНИК", "СЕКСОЛОГ", "СПЕЦАГЕНТ", "СТОМАТОЛОГ", "СТРОИТЕЛЬ", "СУДЬЯ", "ТАТУ-МАСТЕР", "ФЕРМЕР", "ФИЗИК", "ФИЛОСОФ", "ХАКЕР", "ХИМИК",
    "ХИРУРГ", "ЭКОЛОГ", "ЭКСКУРСОВОД", "ЭКСТРАСЕНС", "ЭЛЕКТРИК", "ЭТНОГРАФ"
]

HEALTH = [
    "Отличное", "Хорошее", "Среднее", "Хроническая астма", "Беременность (3 триместр)", "Синдром Туретта", "Бессонница", "Нарколепсия", "СДВГ", "Идеальное зрение", "Полная глухота на одно ухо",
    "АЛКОГОЛИЗМ", "БЕСПЛОДИЕ", "ГАЛЛЮЦИНАЦИИ", "ГИГАНТИЗМ ОТДЕЛЬНЫХ ЧАСТЕЙ ТЕЛА", "ГЛУХОЙ", "ДЕПРЕССИЯ", "ЗАВИСИМОСТЬ ОТ НАРКОТИКОВ", "ЗАИКА", "ИГРОВАЯ ЗАВИСИМОСТЬ", "ИДЕАЛЬНО ЗДОРОВ", "КАРЛИК",
    "КЛЕПТОМАНИЯ", "КОФЕЙНАЯ ЗАВИСИМОСТЬ", "ЛУНАТИЗМ", "МАНИЯ ПРЕСЛЕДОВАНИЯ", "МИГРЕНЬ", "НЕ ОБСЛЕДОВАЛСЯ", "НЕТ НОГИ", "НЕТ РУКИ", "ПОВЫШЕННАЯ ВОЛОСАТОСТЬ", "ПОНОС", "ПОТЕРЯ ОБОНЯНИЯ",
    "РАЗДВОЕНИЕ ЛИЧНОСТИ", "СЕКСУАЛЬНАЯ ОЗАБОЧЕННОСТЬ", "СКЛЕРОЗ", "СЛЕПОЙ", "СУИЦИДАЛЬНЫЕ МЫСЛИ", "ТРЕМОР РУК", "ФРИГИДНОСТЬ", "ИМПОТЕНЦИЯ", "ХВОСТ"
]

BIOLOGY = [
    "АНДРОИД", "Ж 18 Л", "Ж 19 Л Г", "Ж 21 Г", "Ж 22 Г Б", "Ж 24 Г", "Ж 25 Л Г", "Ж 27 Л", "Ж 30 Л", "Ж 31 Г",
    "Ж 33 Л Г", "Ж 34 Г", "Ж 36 Л", "Ж 65 Л", "Ж 99 Л", "КОТГЕНДЕР", "М 101 Г", "М 18 Л", "М 23 Г Г", "М 24 Г Б",
    "М 26 Л", "М 27 Л Г", "М 29 Л", "М 30 Л", "М 32 Г Г", "М 33 Г", "М 35 Л", "М 39 Л", "М 42 Г Г", "М 75 Л"
]

SKILLS = [
    "Умение разводить огонь без спичек", "Навыки оказания первой помощи", "Меткая стрельба", "Умение вести переговоры и договариваться", "Отличная память и эрудиция", "Навык медитации", "Умение штопать и чинить всё из скотча", "Умение готовить из любых подручных продуктов", "Навык взлома замков и механизмов", "Умение петь и играть на инструментах",
    "АБЛЮТОФОБ - БОИТСЯ УМЫВАТЬСЯ", "АНДРОФОБИЯ - БОИТСЯ МУЖЧИН", "БЕЗОТКАЗНЫЙ", "БРОДЯЖНИЧАЛ 2 ГОДА", "ВЕРНУЛСЯ ИЗ ГОРЯЧЕЙ ТОЧКИ", "ВЗЛОМАЛ БАЗУ ДАННЫХ ЦРУ", "ВИДЕЛ ИНОПЛАНЕТЯН", "ВЛАДЕЕТ 5 ЯЗЫКАМИ", "ВРЕТ И ПРЕУВЕЛИЧИВАЕТ", "ВЫРОС В СЕМЬЕ ЛЕСНИКА",
    "ГИНОФОБИЯ - БОИТСЯ ЖЕНЩИН", "ГИПНОТИЧЕСКАЯ УЛЫБКА", "ГРЯЗНО РУГАЕТСЯ", "ДЕРЖАЛ ДОМА 40 КОШЕК", "ДУША КОМПАНИИ", "ЗАНУДА", "ЗАПУСТИЛ ИТ СТАРТАП", "ЗНАЕТ АЗБУКУ МОРЗЕ", "ЗНАЕТ ЛИЧНО ПРЕЗИДЕНТА", "ЗНАЕТ НАИЗУСТЬ ВСЕ СТИХИ ПУШКИНА",
    "ИЗВРАЩЕНЕЦ", "ИСТЕРИЧНЫЙ", "МАНЬЯК-УБИЙЦА", "НАРКОДИЛЕР", "НЕ ПУСКАЮТ В КАЗИНО", "НОБЕЛЕВСКИЙ ЛАУРЕАТ ПО БИОИНЖЕНЕРИИ", "НЫТИК", "ОБЛАДАТЕЛЬ УНИКАЛЬНОГО СОПРАНО", "ОСТАЛСЯ В ЖИВЫХ НА НЕОБИТАЕМОМ ОСТРОВЕ", "ОТЧИСЛЕН ИЗ КЛУБА НАВЫКИ ВЫЖИВАНИЯ",
    "ПИСАЕТСЯ ПО НОЧАМ", "ПИШЕТ С ОШИБКАМИ", "ПОБЕДИТЕЛЬ ПАРАОЛИМПИЙСКИХ ИГР", "ПОДХОДИТ СЗАДИ И ДЫШИТ", "ПОНИМАЕТ ЯЗЫК ЖИВОТНЫХ", "ПРОДАЛ ПОЧКУ", "ПРОШЕЛ 2 НЕДЕЛЬНЫЕ КУРСЫ ПСИХОЛОГА", "ПСИХОПАТ", "РАБОТАЛ В ЭСКОРТ УСЛУГАХ", "РАЗГОВАРИВАЕТ С ДУХАМИ",
    "СДЕЛАЕТ АЛКОГОЛЬ ИЗ ЧЕГО УГОДНО", "СОСТОЯЛ В СЕКТЕ", "СПЛЕТНИК", "СТРОИЛ ПОДОБНЫЕ БУНКЕРЫ", "ТЕЛЕПАТ", "ТОЛЬКО ИЗ ОЧАГА ЭПИДЕМИИ", "ТОРМОЗ", "ХРАПИТ", "ЧИТАЛ ВСЕ КНИГИ ЛАВКРАФТА", "ЭРОТОФОБ - БОИТСЯ СЕКСА"
]

HOBBIES = [
    "Садоводство", "Чтение книг", "Рыбалка", "Туризм", "Коллекционирование насекомых", "Любительская радиосвязь", "Выращивание микрозелени", "Изучение узлов и веревок", "Написание фанфиков", "Dungeons & Dragons",
    "АЛХИМИЯ", "БОЕВЫЕ ИСКУСТВА", "ВУАЙЕРИЗМ", "ГИДРОПОНИКА", "ГРИБЫ И ГОМЕОПАТИЯ", "ДАЧНИК", "ЗОЖ", "КИНО И СЕРИАЛЫ", "КОМПЬЮТЕРНЫЕ ИГРЫ", "КРАЕВЕДЕНИЕ", "МАССАЖ И АКУПУНКТУРА", "МЕДИТАЦИЯ", "НАСТОЛЬНЫЕ ИГРЫ",
    "НЕТВОРКИНГ", "НЕТРАДИЦИОННАЯ МЕДИЦИНА", "ОХОТА И РЫБАЛКА", "ПАРКУР", "ПИВОВАРЕНИЕ", "ПИРОТЕХНИКА", "РАЗГОВОРЫ ПО ДУШАМ", "РОБОТОТЕХНИКА", "СВИНГ-ВЕЧЕРИНКИ", "СОВРЕМЕННОЕ ИСКУССТВО", "СПОРТИВНЫЕ ТАНЦЫ",
    "СТРИПТИЗ", "УФОЛОГИЯ И МИСТИКА", "ФЛУДИТЬ В ЧАТАХ", "ХОЛОДНОЕ ОРУЖИЕ", "ЧЕРНАЯ МАГИЯ"
]

INVENTORY = [
    "Медицинская аптечка", "Охотничий нож", "Набор для розжига огня", "Радиоприемник", "5 кг поваренной соли", "Рулон армированного скотча", "Фляга с крепким самогоном", "Дилдо", "Настольная игра 'Монополия'",
    "Кот в переноске", "Книга 'Как выжить в любых условиях'", "Связка воздушных шариков", "Набор для вышивания крестиком", "3 СЛИТКА ЗОЛОТА", "АНТИБИОТИКИ И ОБЕЗБОЛИВАЮЩЕЕ", "ГИТАРА", "ДЕФИБРИЛЛЯТОР", "ЗВУКОВАЯ ОТВЕРТКА",
    "ИНКУБАТОР С НАБОРОМ ЯИЦ", "ИНСТРУМЕНТЫ ЭЛЕКТРИКА", "КАПКАНЫ И НАБОР ЯДОВ", "КНИГИ АЙЗЕКА АЗИМОВА", "КОМПАС И КАРТА ОКРЕСНОСТЕЙ", "КУКЛА ВУДУ", "ЛУК И СТРЕЛЫ", "МЕШОК ЗЕРНА", "МЕШОК КАРТОШКИ", "МИЛЛИОН ДОЛЛАРОВ",
    "НАБОР ОТМЫЧЕК", "НАДУВНАЯ КУКЛА", "НАСТОЛЬНЫЕ ИГРЫ", "НОЖИ ДЛЯ МЕТАНИЯ", "НОУТБУК И ПЛАТЫ АРДУИНО", "ПЕРЕНОСНАЯ ЭЛЕКТРОСТАНЦИЯ", "ПИСТОЛЕТ", "ПРИБОР НОЧНОГО ВИДЕНИЯ", "САЖЕНЦЫ ФРУКТОВЫХ ДЕРЕВЬЕВ", "СНАЙПЕРСКАЯ ВИНТОВКА",
    "СПИРИТИЧЕСКАЯ ДОСКА", "СТОЛЯРНЫЕ ИНСТРУМЕНТЫ", "ЧЕМОДАНЧИК ФЕЛЬДШЕРА", "ШАПОЧКА ИЗ ФОЛЬГИ", "ЭНЦИКЛОПЕДИЯ ГРИБНИКА"
]

def generate_card():
    return {
        "profession": random.choice(PROFESSIONS),
        "health": random.choice(HEALTH),
        "biology": random.choice(BIOLOGY),
        "skill": random.choice(SKILLS),
        "hobby": random.choice(HOBBIES),
        "inventory": random.choice(INVENTORY)
    }

def generate_cards_for_players(count):
    """Генерирует уникальные карточки для всех игроков"""
    cards = []
    for _ in range(count):
        cards.append(generate_card())
    return cards